In [133]:
from fugue_notebook import setup
import pandas as pd
import seaborn as sns
from typing import List, Any, Dict, Tuple, Iterable
import matplotlib.pyplot as plt
setup()

In [134]:
%%fsql 
df = LOAD "usa_names_2013.csv" (header = true, infer_schema = true)
# YIELD DATAFRAME AS df
PRINT

In [135]:
%%fsql
SELECT COUNT(*) AS cnt FROM df
PRINT

In [136]:
def concat(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    return pd.concat([df1, df2], axis=0).reset_index(drop = True)

In [137]:
def concat2(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    return pd.concat([df1.reset_index(drop = True), df2.reset_index(drop = True)], axis=1)

In [138]:
# schema: *, sex:str
def make_gender (data:Iterable[Dict[str, Any]]) -> Iterable[Dict[str, Any]]:
    for row in data:
        if row['gender'] == 'F':
            row['sex'] = 'Female'
        else :
            row['sex'] = 'Male' 
        yield row

In [139]:
%%fsql 
SELECT * FROM df 
TRANSFORM USING make_gender
YIELD DATAFRAME AS df_with_gender
PRINT

In [140]:
%%fsql 
df_maxname_male = 
SELECT name, number 
FROM df
WHERE gender == 'M'  AND state = 'CA'
ORDER BY number DESC
LIMIT 1
PRINT

df_maxname_female =
SELECT name, number 
FROM df
WHERE gender == 'F'  AND state = 'CA'
ORDER BY number DESC
LIMIT 1

PROCESS df_maxname_female, df_maxname_male USING concat
PRINT

In [141]:
%%fsql 
df_maxname_male = 
SELECT name, number ,sex
FROM df_with_gender
WHERE gender == 'M'  AND state = 'CA'
ORDER BY number DESC
LIMIT 10
YIELD DATAFRAME AS df_malemax_10

df_maxname_female =
SELECT name, number ,sex
FROM df_with_gender
WHERE gender == 'F'  AND state = 'CA'
ORDER BY number DESC
LIMIT 10
YIELD DATAFRAME AS df_femalemax_10


kkk = PROCESS df_maxname_female, df_maxname_male USING concat 
PRINT 20 ROWS

In [142]:
%%fsql
df_max_axis1_f = SELECT name, number FROM df_femalemax_10
df_max_axis1_m = SELECT name AS name_, number AS number_ FROM df_malemax_10
kkk = PROCESS df_max_axis1_f,df_max_axis1_m  USING concat2
PRINT 10 ROWS FROM kkk

In [143]:
%%fsql
SELECT gender, name, number, AVG(number) OVER(PARTITION BY state) AS number_avg
FROM df
WHERE state = 'CA'

YIELD DATAFRAME AS df_test

In [144]:
%%fsql
SELECT gender, name, number, number_avg 
FROM df_test
WHERE number < number_avg
ORDER BY number DESC
PRINT 10 ROWS